In [ ]:
# Logistic regression single and multi variable

#it is same as the linear regression but works only on categoical data.

In [13]:
import warnings
warnings.filterwarnings("ignore")
warnings.simplefilter("ignore")
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

In [14]:
df=pd.read_csv(r"C:\Users\User\Downloads\Datasets\insurance_data.csv")
df.head(5)

   age  bought_insurance
0   22                 0
1   25                 0
2   47                 1
3   52                 0
4   46                 1

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 2 columns):
age                 27 non-null int64
bought_insurance    27 non-null int64
dtypes: int64(2)
memory usage: 560.0 bytes

In [43]:
df.describe()

             age  bought_insurance
count  27.000000         27.000000
mean   39.666667          0.518519
std    15.745573          0.509175
min    18.000000          0.000000
25%    25.000000          0.000000
50%    45.000000          1.000000
75%    54.500000          1.000000
max    62.000000          1.000000

In [15]:
df.head()

   age  bought_insurance
0   22                 0
1   25                 0
2   47                 1
3   52                 0
4   46                 1

In [20]:
x=df.drop("bought_insurance",axis=1)
y=df.bought_insurance

In [55]:
from sklearn.linear_model import LogisticRegression

reg=LogisticRegression()

reg.fit(x,y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [69]:
reg.predict([[22],[25],[30],[31],[32],[33],[34],[35],[36],[37],[38],[39]])

array([0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1], dtype=int64)

In [70]:
reg.coef_

array([[0.05589224]])

In [73]:
reg.intercept_

array([-1.80953063])

In [75]:
reg.score(x,y)

0.8888888888888888

In [78]:
df1=pd.read_csv(r"C:\Users\User\Downloads\Datasets\HR.csv")
df1.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [79]:
df1.salary.unique()

array(['low', 'medium', 'high'], dtype=object)

In [84]:
df1.Department.unique()

array(['sales', 'accounting', 'hr', 'technical', 'support', 'management',
       'IT', 'product_mng', 'marketing', 'RandD'], dtype=object)

In [88]:
from sklearn.preprocessing import LabelEncoder

label=LabelEncoder()

df1.salary=label.fit_transform(df1.salary)
df1.Department=label.fit_transform(df1.Department)

In [89]:
df1.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,7,1
1,0.80,0.86,5,262,6,0,1,0,7,2
2,0.11,0.88,7,272,4,0,1,0,7,2
3,0.72,0.87,5,223,5,0,1,0,7,1
4,0.37,0.52,2,159,3,0,1,0,7,1

In [92]:
df1.isnull().sum()

satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
left                     0
promotion_last_5years    0
Department               0
salary                   0
dtype: int64

In [103]:
x=df1.drop("salary",axis=1)
y=df1.salary

In [105]:
df1.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,7,1
1,0.80,0.86,5,262,6,0,1,0,7,2
2,0.11,0.88,7,272,4,0,1,0,7,2
3,0.72,0.87,5,223,5,0,1,0,7,1
4,0.37,0.52,2,159,3,0,1,0,7,1

In [276]:
from sklearn.linear_model import LogisticRegression

reg=LogisticRegression()
reg.fit(x,y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [1]:
reg.predict([[0.38,0.53,2,157,3,0,1,0,7]])

NameError: name 'reg' is not defined

In [197]:
reg.intercept_

AttributeError: 'LogisticRegression' object has no attribute 'intercept_'

In [110]:
reg.coef_

array([[-2.16880764e-01, -4.66367718e-01, -4.07614122e-02,
         4.07714099e-04,  1.01255346e-01, -1.23435200e-01,
        -1.60848557e+00,  9.32373667e-01, -3.40979585e-02],
       [ 1.25890792e-02,  1.50802629e-01,  8.36886287e-03,
        -4.28431895e-04, -8.17966291e-02,  1.03419097e-01,
         6.77102417e-01, -1.13601546e+00,  2.05652415e-02],
       [ 5.90169417e-02, -5.32946080e-03,  5.47058894e-03,
         2.27556214e-04,  3.45007906e-02, -6.12327938e-02,
        -3.34485874e-01,  4.73478905e-01, -1.02589819e-02]])

In [196]:
reg.score(x,y)

NotFittedError: This LogisticRegression instance is not fitted yet

In [140]:
df2=pd.read_csv(r"C:\Users\User\Downloads\Datasets\townprice.csv")
df2

               town  area   price
0   monroe township  2600  550000
1   monroe township  3000  565000
2   monroe township  3200  610000
3   monroe township  3600  680000
4   monroe township  4000  725000
5      west windsor  2600  585000
6      west windsor  2800  615000
7      west windsor  3300  650000
8      west windsor  3600  710000
9       robinsville  2600  575000
10      robinsville  2900  600000
11      robinsville  3100  620000
12      robinsville  3600  695000

In [142]:
df2.town.unique()

array(['monroe township', 'west windsor', 'robinsville'], dtype=object)

In [143]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
town     13 non-null object
area     13 non-null int64
price    13 non-null int64
dtypes: int64(2), object(1)
memory usage: 440.0+ bytes

In [124]:
df2.isnull().sum()

town     0
area     0
price    0
dtype: int64

In [144]:
dummies=pd.get_dummies(df2.town)
dummies

    monroe township  robinsville  west windsor
0                 1            0             0
1                 1            0             0
2                 1            0             0
3                 1            0             0
4                 1            0             0
5                 0            0             1
6                 0            0             1
7                 0            0             1
8                 0            0             1
9                 0            1             0
10                0            1             0
11                0            1             0
12                0            1             0

In [285]:
merge=pd.concat([df2,dummies],axis=1)
merge

               town  area   price  monroe township  robinsville  west windsor
0   monroe township  2600  550000                1            0             0
1   monroe township  3000  565000                1            0             0
2   monroe township  3200  610000                1            0             0
3   monroe township  3600  680000                1            0             0
4   monroe township  4000  725000                1            0             0
5      west windsor  2600  585000                0            0             1
6      west windsor  2800  615000                0            0             1
7      west windsor  3300  650000                0            0             1
8      west windsor  3600  710000                0            0             1
9       robinsville  2600  575000                0            1             0
10      robinsville  2900  600000                0            1             0
11      robinsville  3100  620000                0            1             0
12      robinsville  3600  695000                0            1             0

In [186]:
final=merge.drop("town",axis=1)
final

    area   price  monroe township  robinsville  west windsor
0   2600  550000                1            0             0
1   3000  565000                1            0             0
2   3200  610000                1            0             0
3   3600  680000                1            0             0
4   4000  725000                1            0             0
5   2600  585000                0            0             1
6   2800  615000                0            0             1
7   3300  650000                0            0             1
8   3600  710000                0            0             1
9   2600  575000                0            1             0
10  2900  600000                0            1             0
11  3100  620000                0            1             0
12  3600  695000                0            1             0

In [267]:
x=final.drop("price",axis=1)
y=final.price
x

    area  monroe township  robinsville  west windsor
0   2600                1            0             0
1   3000                1            0             0
2   3200                1            0             0
3   3600                1            0             0
4   4000                1            0             0
5   2600                0            0             1
6   2800                0            0             1
7   3300                0            0             1
8   3600                0            0             1
9   2600                0            1             0
10  2900                0            1             0
11  3100                0            1             0
12  3600                0            1             0

In [286]:
from sklearn.tree import DecisionTreeRegressor
model=DecisionTreeRegressor()
model.fit(x,y)

DecisionTreeRegressor(criterion='mse', max_depth=None, max_features=None,
                      max_leaf_nodes=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      presort=False, random_state=None, splitter='best')

In [287]:
model.predict([[2600,0,1,0]])

array([575000.])

In [288]:
model.score(x,y)

1.0

In [274]:
model.intercept_

231676.52117832546

In [275]:
model.coef_

array([   126.89744141, -21900.12900452,   3786.28251989,  18113.84648463])